sdaiValidateArrayNotOptional(Sdai_instS*,Sdai_Id_aggr*)
\details
Checks whether array instances whose array type declaration does not allow optional elements
have values at all index positions.
\param instance [in]  Identifier of the application instance to be validated.
\param list     [out] An identifier of a pre-existing NPL to which the SdaiAttr identifiers of
\returns
sdaiTRUE if all instances of array items has not unset values, otherwise returns sdaiFALSE;
\remarks
Possible error codes:
* sdaiSS_NOPN - Session is not open.
* sdaiTR_NAVL - Transaction currently not available.
* sdaiTR_EAB - Transaction ended abnormally.
* sdaiRP_NOPN - Repository is not open.
* sdaiMX_NDEF - SDAI-model access not defined.
* sdaiEI_NEXS - Instance does not exist.
* sdaiAI_NEXS - Aggregate instance does not exist.
* sdaiEX_NSUP - Expression evaluation not supported.
* sdaiVA_NSET - Value not set.
* sdaiFN_NAVL - Function not available.
* sdaiSY_ERR - Underlying system error.